-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Фев 17 2025 г., 20:06
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `befree-website`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cart`
--

CREATE TABLE `cart` (
  `id` int(255) NOT NULL COMMENT 'Заказ',
  `user_id` varchar(255) NOT NULL COMMENT 'Пользователь',
  `product_id` varchar(12) NOT NULL COMMENT 'Артикул товара',
  `property` varchar(255) NOT NULL COMMENT 'Свойство',
  `quantity` varchar(255) NOT NULL COMMENT 'Количество'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `cart`
--

INSERT INTO `cart` (`id`, `user_id`, `product_id`, `property`, `quantity`) VALUES
(15, '5', 'BF2441601031', 'L', '1'),
(16, '5', 'BF2441601039', 'S', '2'),
(38, '1', 'BF2441601031', 'M', '1'),
(39, '1', 'BF2441601039', 'S', '1'),
(40, '1', 'BF2441601027', 'S', '1'),
(41, '6', 'BF2441601027', 'XS', '1'),
(43, '7', 'BF2441601072', 'XL', '3');

-- --------------------------------------------------------

--
-- Структура таблицы `description`
--

CREATE TABLE `description` (
  `article` varchar(12) NOT NULL COMMENT 'Артикул',
  `color` varchar(255) NOT NULL COMMENT 'Цвет',
  `composition` varchar(255) NOT NULL COMMENT 'Состав',
  `cut` varchar(255) NOT NULL COMMENT 'Покрой',
  `length` varchar(255) NOT NULL COMMENT 'Длина',
  `insulation` varchar(255) NOT NULL COMMENT 'Утеплитель',
  `zipper` varchar(255) NOT NULL COMMENT 'Застёжка',
  `cutout` varchar(255) NOT NULL COMMENT 'вырез',
  `straps` varchar(255) NOT NULL COMMENT 'вид бретелей',
  `sleeve` varchar(255) NOT NULL COMMENT 'рукава',
  `waist` varchar(255) NOT NULL COMMENT 'талия',
  `hood` varchar(255) NOT NULL COMMENT 'Капюшон',
  `recommendations` varchar(255) NOT NULL COMMENT 'Рекомендации по уходу'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='Таблица свойств товара';

--
-- Дамп данных таблицы `description`
--

INSERT INTO `description` (`article`, `color`, `composition`, `cut`, `length`, `insulation`, `zipper`, `cutout`, `straps`, `sleeve`, `waist`, `hood`, `recommendations`) VALUES
('BF2441601027', 'серый', 'подкладка: полиэстер 100%; верх: полиэстер 100%; утеплитель: полиэстер 100%', 'свободный', 'длинный', 'синтепух', 'молния', '0', '0', '0', '0', 'без капюшона', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2441601031', 'черный', 'подкладка: полиэстер 100%; верх: полиэстер 100%; утеплитель: полиуретан 100%', 'свободный', 'короткий', 'синтепух', 'молния', '0', '0', '0', '0', 'без капюшона', 'не стирать, не отбеливать, вертикальная сушка, не гладить, сухая чистка запрещена'),
('BF2441601035', 'розовый', 'подкладка: полиэстер 100%; верх: полиэстер 100%; утеплитель: полиэстер 100%', 'свободный', 'короткий', 'синтепух', 'молния', '0', '0', '0', '0', 'без капюшона', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка в углеводородах, мягкий режим'),
('BF2441601039', 'бежевый', 'верх: полиэстер 100%; утеплитель: без утеплителя', 'прямой', 'средний', 'без утепления', 'молния', '0', '0', '0', '0', 'без капюшона', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2441601048', 'бежевый', 'подкладка: полиэстер 100%; верх: полиэстер 100%; утеплитель: пух 50%, перо 50%', 'свободный', 'длинный', 'пух', 'молния', '0', '0', '0', '0', 'без капюшона', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2441601052', 'черный', 'подкладка: полиэстер 100%; верх: полиэстер 100%; утеплитель: полиуретан 100%', 'свободный', 'средний', 'синтепух', 'молния', '0', '0', '0', '0', 'есть, несъемный', 'не стирать, не отбеливать, вертикальная сушка, не гладить, сухая чистка запрещена'),
('BF2441601072', 'молочный', 'подкладка: полиэстер 100%; верх: полиэстер 100%; утеплитель: полиэстер 100%', 'свободный', 'длинный', 'синтепон', 'кнопки', '0', '0', '0', '0', 'есть, несъемный', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2441601073', 'черный', 'подкладка: полиэстер 100%; верх: полиэстер 100%; утеплитель: полиэстер 100%', 'свободный', 'длинный', 'синтепух', 'молния', '0', '0', '0', '0', 'есть, несъемный', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2441601077', 'черный', 'подкладка: полиэстер 100%; верх: полиэстер 100%; утеплитель: полиэстер 100%', 'свободный', 'средний', 'синтепух', 'молния', '0', '0', '0', '0', 'есть, несъемный', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2441602002', 'серый', 'верх: полиэстер 100%; подкладка: полиэстер 100%; утеплитель: полиэстер 100%', 'свободный', 'средний', 'синтепон', 'кнопки', '0', '0', '0', '0', 'без капюшона', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2442601020', 'зеленый', 'верх: полиэстер 100%; утеплитель: полиэстер 100%', 'свободный', 'средний', 'синтепон', 'молния', '0', '0', '0', '0', 'без капюшона', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2442601022', 'мультиколор', 'верх: полиэстер 100%; подкладка: полиэстер 100%; утеплитель: полиэстер 100%', 'свободный', 'средний', 'синтепон', 'молния', '0', '0', '0', '0', 'есть, несъемный', 'не стирать, не отбеливать, вертикальная сушка, не гладить, профессиональная сухая чистка, мягкий режим'),
('BF2511414025', 'черный', 'основной материал: полиэстер 100%; подкладка: полиэстер 100%', '0', 'мини', '0', '0', 'отложной воротничок', 'без бретелей', 'короткие', 'завышенная', '0', 'не стирать, не отбеливать, машинная сушка запрещена, глажение при 110ºС, профессиональная сухая чистка'),
('BF2511414029', 'голубой', 'основной материал: полиэстер 100%', '0', 'мини', '0', '0', 'круглый', 'без бретелей', 'длинные', 'средняя', '0', 'бережная стирка при максимальной температуре 30ºС, не отбеливать, машинная сушка запрещена, глажение при 110ºС, профессиональная сухая чистка'),
('BF2511414041', 'молочный', 'основной материал: полиэстер 100%; подкладка: полиамид 100%', '0', 'мини', '0', '0', 'V-образный', 'без бретелей', 'длинные', 'средняя', '0', 'ручная стирка в холодной воде, не отбеливать, машинная сушка запрещена, не гладить, профессиональная сухая чистка'),
('BF2521414035', 'голубой', 'основной материал: полиэстер 100%; подкладка: полиэстер 100%', '0', 'мини', '0', '0', 'круглый', 'без бретелей', 'короткие', 'средняя', '0', 'бережная стирка при максимальной температуре 30ºС, не отбеливать, машинная сушка запрещена, глажение при 110ºС, профессиональная сухая чистка');

-- --------------------------------------------------------

--
-- Структура таблицы `feedback`
--

CREATE TABLE `feedback` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `message` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='Форма обратной связи';

--
-- Дамп данных таблицы `feedback`
--

INSERT INTO `feedback` (`id`, `name`, `email`, `message`) VALUES
(3, 'Настя', 'bnastya2017@mail.com', 'Проверка123'),
(4, 'gpsg', 'arnn@nvns.ci', '00100001101100'),
(5, 'gpsg', 'arnn@nvns.ci', '00100001101100'),
(6, 'ngnga', 'HP@hogwarts.com', '12345');

-- --------------------------------------------------------

--
-- Структура таблицы `images`
--

CREATE TABLE `images` (
  `id` int(11) NOT NULL,
  `article` varchar(12) NOT NULL COMMENT 'Артикул',
  `image` varchar(255) NOT NULL COMMENT 'Ссылка на картинку'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='Таблица картинок товаров';

--
-- Дамп данных таблицы `images`
--

INSERT INTO `images` (`id`, `article`, `image`) VALUES
(1, 'BF2441602002', 'BF2441602002_1.webp'),
(2, 'BF2441602002', 'BF2441602002_2.webp'),
(3, 'BF2441602002', 'BF2441602002_3.webp'),
(4, 'BF2441602002', 'BF2441602002_4.webp'),
(5, 'BF2441602002', 'BF2441602002_5.webp'),
(6, 'BF2441602002', 'BF2441602002_6.webp'),
(7, 'BF2441602002', 'BF2441602002_7.webp'),
(8, 'BF2441602002', 'BF2441602002_8.webp'),
(9, 'BF2441602002', 'BF2441602002_9.webp'),
(10, 'BF2441602002', 'BF2441602002_10.webp'),
(11, 'BF2441602002', 'BF2441602002_11.webp'),
(12, 'BF2441602002', 'BF2441602002_12.webp'),
(13, 'BF2442601022', 'BF2442601022_1.webp'),
(14, 'BF2442601022', 'BF2442601022_2.webp'),
(15, 'BF2442601022', 'BF2442601022_3.webp'),
(16, 'BF2442601022', 'BF2442601022_4.webp'),
(17, 'BF2442601022', 'BF2442601022_5.webp'),
(18, 'BF2442601022', 'BF2442601022_6.webp'),
(19, 'BF2442601022', 'BF2442601022_7.webp'),
(20, 'BF2442601022', 'BF2442601022_8.webp'),
(21, 'BF2442601022', 'BF2442601022_9.webp'),
(22, 'BF2442601022', 'BF2442601022_10.webp'),
(23, 'BF2441601039', 'BF2441601039_1.webp'),
(24, 'BF2441601039', 'BF2441601039_2.webp'),
(25, 'BF2441601039', 'BF2441601039_3.webp'),
(26, 'BF2441601039', 'BF2441601039_4.webp'),
(27, 'BF2441601039', 'BF2441601039_5.webp'),
(28, 'BF2441601039', 'BF2441601039_6.webp'),
(29, 'BF2441601039', 'BF2441601039_7.webp'),
(30, 'BF2441601039', 'BF2441601039_8.webp'),
(31, 'BF2441601039', 'BF2441601039_9.webp'),
(32, 'BF2441601072', 'BF2441601072_1.webp'),
(33, 'BF2441601072', 'BF2441601072_2.webp'),
(34, 'BF2441601072', 'BF2441601072_3.webp'),
(35, 'BF2441601072', 'BF2441601072_4.webp'),
(36, 'BF2441601072', 'BF2441601072_5.webp'),
(37, 'BF2441601072', 'BF2441601072_6.webp'),
(38, 'BF2441601072', 'BF2441601072_7.webp'),
(39, 'BF2441601072', 'BF2441601072_8.webp'),
(40, 'BF2441601072', 'BF2441601072_9.webp'),
(41, 'BF2441601072', 'BF2441601072_10.webp'),
(42, 'BF2441601048', 'BF2441601048_1.webp'),
(43, 'BF2441601048', 'BF2441601048_2.webp'),
(44, 'BF2441601048', 'BF2441601048_3.webp'),
(45, 'BF2441601048', 'BF2441601048_4.webp'),
(46, 'BF2441601048', 'BF2441601048_5.webp'),
(47, 'BF2441601048', 'BF2441601048_6.webp'),
(48, 'BF2441601048', 'BF2441601048_7.webp'),
(49, 'BF2441601052', 'BF2441601052_1.webp'),
(50, 'BF2441601052', 'BF2441601052_2.webp'),
(51, 'BF2441601052', 'BF2441601052_3.webp'),
(52, 'BF2441601052', 'BF2441601052_4.webp'),
(53, 'BF2441601052', 'BF2441601052_5.webp'),
(54, 'BF2441601052', 'BF2441601052_6.webp'),
(55, 'BF2441601035', 'BF2441601035_1.webp'),
(56, 'BF2441601035', 'BF2441601035_2.webp'),
(57, 'BF2441601035', 'BF2441601035_3.webp'),
(58, 'BF2441601035', 'BF2441601035_4.webp'),
(59, 'BF2441601035', 'BF2441601035_5.webp'),
(60, 'BF2441601035', 'BF2441601035_6.webp'),
(61, 'BF2441601073', 'BF2441601073_1.webp'),
(62, 'BF2441601073', 'BF2441601073_2.webp'),
(63, 'BF2441601073', 'BF2441601073_3.webp'),
(64, 'BF2441601073', 'BF2441601073_4.webp'),
(65, 'BF2441601073', 'BF2441601073_5.webp'),
(66, 'BF2441601073', 'BF2441601073_6.webp'),
(67, 'BF2441601077', 'BF2441601077_1.webp'),
(68, 'BF2441601077', 'BF2441601077_2.webp'),
(69, 'BF2441601077', 'BF2441601077_3.webp'),
(70, 'BF2441601077', 'BF2441601077_4.webp'),
(71, 'BF2441601077', 'BF2441601077_5.webp'),
(72, 'BF2441601077', 'BF2441601077_6.webp'),
(73, 'BF2441601031', 'BF2441601031_1.webp'),
(74, 'BF2441601031', 'BF2441601031_2.webp'),
(75, 'BF2441601031', 'BF2441601031_3.webp'),
(76, 'BF2441601031', 'BF2441601031_4.webp'),
(77, 'BF2441601031', 'BF2441601031_5.webp'),
(78, 'BF2441601031', 'BF2441601031_6.webp'),
(79, 'BF2441601027', 'BF2441601027_1.webp'),
(80, 'BF2441601027', 'BF2441601027_2.webp'),
(81, 'BF2441601027', 'BF2441601027_3.webp'),
(82, 'BF2441601027', 'BF2441601027_4.webp'),
(83, 'BF2441601027', 'BF2441601027_5.webp'),
(84, 'BF2441601027', 'BF2441601027_6.webp'),
(85, 'BF2442601020', 'BF2442601020_1.webp'),
(86, 'BF2442601020', 'BF2442601020_2.webp'),
(87, 'BF2442601020', 'BF2442601020_3.webp'),
(88, 'BF2442601020', 'BF2442601020_4.webp'),
(89, 'BF2442601020', 'BF2442601020_5.webp'),
(90, 'BF2442601020', 'BF2442601020_6.webp'),
(91, 'BF2511414041', 'BF2511414041_1.webp'),
(92, 'BF2511414041', 'BF2511414041_2.webp'),
(93, 'BF2511414041', 'BF2511414041_3.webp'),
(94, 'BF2511414041', 'BF2511414041_4.webp'),
(95, 'BF2511414025', 'BF2511414025_1.webp'),
(96, 'BF2511414025', 'BF2511414025_2.webp'),
(97, 'BF2511414025', 'BF2511414025_3.webp'),
(98, 'BF2511414025', 'BF2511414025_4.webp'),
(99, 'BF2521414035', 'BF2521414035_1.webp'),
(100, 'BF2521414035', 'BF2521414035_2.webp'),
(101, 'BF2521414035', 'BF2521414035_3.webp'),
(102, 'BF2521414035', 'BF2521414035_4.webp'),
(107, 'BF2511414029', 'BF2511414029_1.webp'),
(108, 'BF2511414029', 'BF2511414029_2.webp'),
(109, 'BF2511414029', 'BF2511414029_3.webp'),
(110, 'BF2511414029', 'BF2511414029_4.webp');

-- --------------------------------------------------------

--
-- Структура таблицы `product`
--

CREATE TABLE `product` (
  `article` varchar(12) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `category` varchar(255) NOT NULL COMMENT 'Категория товара',
  `image` varchar(255) NOT NULL,
  `price` float UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='Товары магазина';

--
-- Дамп данных таблицы `product`
--

INSERT INTO `product` (`article`, `product_name`, `category`, `image`, `price`) VALUES
('BF2441601027', 'Пальто стеганое с опушкой из искусственного меха', 'женская верхняя одежда', 'PSsOisIM.webp', 2599),
('BF2441601031', 'Куртка стеганая с широким воротником', 'женская верхняя одежда', 'KSs4V.webp', 2999),
('BF2441601035', 'Куртка стеганая укороченная с меховой фактурой', 'женская верхняя одежда', 'KSUsMF-5.webp', 3599),
('BF2441601039', 'Дубленка из искусственной замши с отделкой', 'женская верхняя одежда', 'DisZsO.webp', 3999),
('BF2441601048', 'Пуховик стеганый на натуральном утеплителе', 'женская верхняя одежда', 'PSnaNU.webp', 5599),
('BF2441601052', 'Куртка из искусственной кожи с капюшоном', 'женская верхняя одежда', 'KisIKsK.webp', 2999),
('BF2441601072', 'Пальто утепленное с капюшоном и поясом', 'женская верхняя одежда', 'PUsKiP.webp', 3999),
('BF2441601073', 'Куртка стеганая удлиненная с капюшоном', 'женская верхняя одежда', 'KSUsK.webp', 2599),
('BF2441601077', 'Куртка стеганая утепленная с капюшоном', 'женская верхняя одежда', 'KSUsK-5.webp', 2999),
('BF2441602002', 'Шуба из искусственного меха с длинным ворсом', 'женская верхняя одежда', 'FurcoatIMsDV.webp', 6999),
('BF2442601020', 'Куртка двусторонняя с меховой фактурой и принтом', 'женская верхняя одежда', 'KDsMFiP.webp', 3999),
('BF2442601022', 'Куртка-бомбер из искусственного меха с капюшоном', 'женская верхняя одежда', 'KBisIMsK.webp', 5999),
('BF2511414025', 'Платье мини с белым воротничком и оборками', 'платья', 'PMsBViO.webp', 2999),
('BF2511414029', 'Платье мини приталенное с рукавами-фонариками', 'платья', 'PMPsRF.webp', 2799),
('BF2511414041', 'Платье мини приталенное с цветочной вышивкой', 'платья', 'PMPsCV.webp', 3800),
('BF2521414035', 'Платье мини шифоновое с асимметричным воланом', 'платья', 'PMSHsAV.webp', 3599);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(5) UNSIGNED NOT NULL COMMENT 'Уникальный идентификатор',
  `login` varchar(50) NOT NULL COMMENT 'Логин',
  `name` varchar(255) NOT NULL COMMENT 'Имя',
  `surname` varchar(255) NOT NULL COMMENT 'Фамилия',
  `email` varchar(70) NOT NULL COMMENT 'Почта',
  `phone` varchar(15) NOT NULL COMMENT 'Номер телефона',
  `password` varchar(130) NOT NULL COMMENT 'Пароль'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `name`, `surname`, `email`, `phone`, `password`) VALUES
(1, 'Amy Pond', 'Amelia', 'Pond', 'DoctorWho@mail.com', '8-926-157-48-30', '$2y$10$OoyBnkFLF6XJdw4LfjPemOHxrSf89/j/p6VSv7/6Qdt43m5/rM/B6'),
(5, 'Настик', 'Анастасия', 'Белоусова', 'bnastya2017@mail.com', '7-925-140-42-73', '$2y$10$l9D9LZCjJPteN0KV5pz9PuLs61mTP59t4RvtrZCHNyghPAEYt7iYu'),
(6, 'Куркума', 'Чеми', 'Камбала', 'fsde@help.com', '8-902-361-21-70', '$2y$10$URb4w4rPOoCYo2nCBjfLKu82LjXh/Kyr8EKhjoHHi9iI91wDA/lpS'),
(7, 'Е Подвигина', '', '', 'epodvigina@bk.ru', '', '$2y$10$v/htErgxXnKgZECEL2m66OKDHiUscWsTlIGOJs2bP.M05MJNSIUvi');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `description`
--
ALTER TABLE `description`
  ADD UNIQUE KEY `article` (`article`);

--
-- Индексы таблицы `feedback`
--
ALTER TABLE `feedback`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `images`
--
ALTER TABLE `images`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`article`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cart`
--
ALTER TABLE `cart`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT COMMENT 'Заказ', AUTO_INCREMENT=44;

--
-- AUTO_INCREMENT для таблицы `feedback`
--
ALTER TABLE `feedback`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `images`
--
ALTER TABLE `images`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=111;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'Уникальный идентификатор', AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
