<!DOCTYPE html>
<html>
	<head>
	<?php require_once "Blocks/head.php"; ?>
	</head>
	<body>
	<?php require_once "Blocks/header.php"; ?>
		<br>
		<table border="0" width="900" cellpadding="5" cellpaccing="0" align="center">
			<td>
				<h1 align="center">сертификаты и купоны</h1>
				<p><img src="Images/gift_certificate_desktop.jpg" align="top" width="100%" height="100%"></p>
				<table cellpadding="20" cellspacing="5">
                    <td width="100" cellpadding="5" valign="top" align="left">
                        <p><a href="#certificate" class="Links">сертификат</a></p>
                        <p><a href="#kupon" class="Links">купон</a></p>
                    </td>
                    <td>
                        <h3 id="certificate" align="center">Подарочный сертификат</h3>
                        <p><b>В продаже во всех магазинах Befree собственной розничной сети вы сможете найти новые подарочные сертификаты!</b></p>
                        <p>Индивидуальный дизайн и свободный номинал* делают их прекрасным подарком — выбирайте внешний вид и решайте, сколько денег положить на подарочную карту прямо на кассе.</p>
                        <p>Где использовать сертификат?
                        <ul>
                            <li>Подарочный сертификат можно использовать только в розничных магазинах Befree</li>
                            <li>В магазинах франчайзинговой сети сертификат не действует. Узнать статус магазина можно на странице befree.ru/stores (сертификаты действуют только в магазинах с указанием статуса «розница Befree»)</li>
                        </ul>
                        </p>
                        <p>
                        Как использовать сертификат?
                        <ul>
                            <li>Если сумма покупки превышает баланс сертификата, доплатить недостающую сумму можно при расчете на кассе в магазине</li>
                            <li>Подарочным сертификатом можно пользоваться неограниченное количество раз, пока не закончится баланс или истечет срок действия</li>
                            <li>Сертификат не именной: Вы можете передать его другому человеку. В этом случае рекомендуем ознакомить его с правилами использования</li>
                            <li>В случае возврата товара, денежные средства вернутся на банковскую карту</li>
                            <li>Узнать оставшийся баланс сертификата можно в любом магазине собственной розничной сети Befree</li>
                            <li>Сертификат не подлежит замене в случае кражи, утери или повреждения</li>
                        </ul>
                        </p>
                        <hr>
                        <h3 id="kupon" align="center">Купон</h3>
                        <p><b>Купон, в отличие от подарочного сертификата, нельзя купить — только выиграть в соцсетях бренда Befree или в розыгрышах торговых центров.</b></p>
                        <p>
                        Где использовать купон?
                        <ul>
                            <li>Подарочный купон можно использовать только в магазинах собственной розничной сети Befree</li>
                            <li>В магазинах франчайзинговой сети купон не действует. Узнать статус магазина можно на странице befree.ru/stores (купон действует только в магазинах с указанием статуса «розница Befree»)</li>
                        </ul>
                        </p>
                        Как использовать купон?
                        <ul>
                            <li>Купоном можно воспользоваться только один раз. Остаток денежных средств не возвращается</li>
                            <li>Номинал купона не суммируется с подарочными сертификатами</li>
                            <li>Купон не именной: Вы можете передать его другому человеку. В этом случае рекомендуем ознакомить его с правилами использования</li>
                            <li>Не подлежит возврату и обмену на денежные средства</li>
                            <li>Купон не подлежит замене в случае кражи, утери или повреждения</li>
                        </ul>
                    </td>
				</table>
			</td>
		</table>
		<?php require_once "Blocks/feedback.php"; ?>
	</body>
	<footer>
	<?php require_once "Blocks/footer.php"; ?>
	</footer>
</html>