<!DOCTYPE html>
<html>
	<head>
	<?php require_once "Blocks/head.php"; ?>
	</head>
	<body>
	<?php require_once "Blocks/header.php"; ?>
		<table border="0" width="900" cellpadding="5" cellpaccing="0" align="center">
			<td>
				<h1 align="center">о компании</h1>
				<p><img src="Images/people.jpg" align="top" width="100%" height="100%"></p>
                <p align="justify">
                    <p>Melon Fashion Group — крупнейший и быстрорастущий fashion-ретейлер России, управляющий брендами ZARINA, Befree, LOVE REPUBLIC, sela и IDOL.<br>
                    Каждый бренд имеет уникальную концепцию, четкое позиционирование, характерный ДНК и ярко выраженную целевую аудиторию.</p>
                    <p>Melon Fashion Group любит моду и адаптирует ее так, чтобы каждый мог выразить свою индивидуальность. Чувствовать себя гармонично и уверенно.
                    Достичь самых смелых целей. Быть частью культуры. Вместе мы создаем fashion-наследие России.</p>
                    <p>За годы существования Melon Fashion Group зарекомендовала себя не только ведущим игроком на fashion-рынке России и стран СНГ, предлагающим высококачественный продукт и сервис для своих клиентов, но работодателем с успешной репутацией. Более 8 000 сотрудников обеспечивают стабильную и эффективную работу компании.</p>
                </p>
				<p>Melon Fashion Group это:</p>
				<ul type="circle">
					<li>пять уникальных брендов</li>
					<li>стильные и доступные коллекции, обновляющиеся каждую неделю</li>
					<li>запоминающиеся рекламные кампании и успешные сотрудничества</li>
					<li>более 930 магазинов в 170 городах и 5 странах</li>
					<li>№1 по продажам на маркетплейсах</li>
					<li>лучший работодатель среди fashion-компаний России по версии hh.ru и Forbes</li>
					<li>собственная ESG-стратегия</li>
					<li>социально-ответственный бизнес</li>
				</ul>
				<p>Более подробная история о Мэлон Фэшн Груп, дополнительная информация и контакты сотрудников штаб-квартиры представлены на официальном сайте компании</p>
				<a href="https://melonfashion.ru/" class="Links">www.melonfashion.ru</a>
			</td>
		</table>
		<?php require_once "Blocks/feedback.php"; ?>
	</body>
	<footer>
    <?php require_once "Blocks/footer.php"; ?>
	</footer>
</html>