<!DOCTYPE html>
<html>
	<head>
	<?php require_once "Blocks/head.php"; ?>
	</head>
	<body>
	<?php require_once "Blocks/header.php"; ?>
		<br>
		<table border="0" width="900" cellpadding="5" cellpaccing="0" align="center">
			<td>
				<h1 align="center">Оплата</h1>
				<p><img src="Images/payment.jpg" align="top" width="100%" height="100%"></p>
				<hr width="900">
				<h3><img src="Images/sbp_logo.png" align="right" width="10%" height="10%">СБП (Система быстрых платежей)</h3>
				<p align="justify">Быстрая и удобная оплата заказов с помощью QR-кода через новый сервис Банка России — Система быстрых платежей.
				Для оплаты по QR-коду не требуется банковская карта. Нужен лишь телефон, на котором установлено мобильное приложение банка.
				Подробнее о данном методе оплаты можно узнать здесь.</p>
				<h3><img src="Images/visa_logo.png" align="right" width="10%" height="10%">Банковской картой онлайн</h3>
				<p align="justify">Для осуществления платежа вам потребуется сообщить данные пластиковой карты.
					Передача этих сведений производится с соблюдением всех необходимых мер безопасности.
					Данные будут переданы только на авторизационный сервер Банка по защищенному каналу (протокол SSL 3.0).
					Информация передается в зашифрованном виде и сохраняется только на специализированном сервере платежной системы.
					Сайты и магазины не знают и не хранят данные по вашей банковской карте.<br>
					Также вы можете воспользоваться Yandex Pay.
					Если у вас есть банковская карта, привязанная к аккаунту в Яндекс, то вы можете оплатить заказ с помощью Yandex Pay, не вводя её данные.
				</p>
				<h3><img src="Images/podeli_logo.png" align="right" width="10%" height="10%">Подели — сервис оплаты покупок по частям</h3>
				<p align="justify">
					Сегодня оплачивайте только 25% стоимости покупки, остальное — тремя платежами раз в 2 недели.
					Это не кредит, никаких дополнительных платежей и процентов — как обычная оплата картой!<br>
					Как купить? Всё просто:
					<ul type="circle"></ul>
						<li>Выберите Подели в способах оплаты в корзине;</li>
						<li>Заполните короткую анкету;</li>
						<li>Оплатите 25% стоимости и покупка уже ваша!</li>
						<li>Остальные три платежа будут списываться с вашей банковской карты автоматически раз в две недели;</li>
						<li>Следите за графиком платежей в личном кабинете или мобильном приложении <a href="https://podeli.ru/" class="Links">Подели</a></li>
					</ul>
				</p>
				<p>Подробнее о сервисе на <a href="https://podeli.ru/" class="Links">podeli.ru</a></p>
				<p>Данный метод оплаты временно недоступен для заказов с самовывозом из розничных магазинов Befree.</p>
			</td>
		</table>
	</body>
	<footer>
    <?php require_once "Blocks/footer.php"; ?>
	</footer>
</html>